Revit 2027 API
ElectricalSetting.WireTypes Property
 Get all wire type definition information of the project.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public WireTypeSet WireTypes { get; }
Public ReadOnly Property WireTypes As WireTypeSet
	Get
public:
property WireTypeSet^ WireTypes {
	WireTypeSet^ get ();
}
member WireTypes : WireTypeSet with get
Property Value
WireTypeSet
See Also
Reference
ElectricalSetting Class
Autodesk.Revit.DB.Electrical Namespace